/*  This file is part of Misli.

    Misli is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    Misli is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with Misli.  If not, see <http://www.gnu.org/licenses/>.
*/

//Записките да се появяват и изчезват в зависимост от това дали размерът им е в порядък близък до този на viewport-a.
//Даже може по-скоро да се конкурират на този принцип с най-близките до тях (с които се борят за пространството). Така ще
//се запълва почти всеки период (независимо с колко малка информация за него) със съдържание и ще има как да го адресирам.
//И ще мога да достигам до по-високойерархичните или по-нискойерархичните нива в този район. За целта трябва да има
//представителност от нискойерархичните обекти във високо-йерархичните и обратно де.

//Тодо:
//Oправяне на динамиката на скролване (различна скорост на различните нива)...тя май е ок
//Оправяне на преливането на скалите (изключване/включване при разл нива)...дън
//Изкарване на надписи на дни, години, месеци...дън
//да направя интерфейс (клас) за база на модулите...дън
//да направя модул за записките (накуп) и да го използвам и тествам...дън
//Да направя централната линия да може да си променя позицията лесно...дън
//Да преместя tabWidget-a от ui в misliwindow class-а...дън
//После да продължа оправянето на EditNoteDialogue::newNote()...дън
//После ArchiveModule, който да отваря archive.timeline като nf...дън
//В paintevent-a съм и тр да направя рисуването...дън
//Бъгаво е рисуването, координатите или на запазване или на рисуване са кофти...дън
//Font пропорционален на големината на записката (в сек)...дън
//Бъгав е още Note::drawNote дето го дооправям, само трябва да зацепя как да ползвам QTransform-а вместо heightScaleFactor

//Принципно после трябва модулите да преобразуват записките така че размерът им на таймлана да е записан като дати
//Да направя форма за въвеждане на архивни записки и да въведа някакви за да тествам как трябва да реагират
//Като измисляш как ще се изобразява един вид информация се абстрахирай от останалите!
//Принципно в дневника не трябва да има overlap-ване, т.е. не трябва да го мисля колко ще е грозно ако се засичат
//Т.е. ще е съвсем адекватно най-отгоре да са най-обхватните като време, а под тях да са останалите
//Не е лошо да има заглавия, които може да се маркират като такива с определен фонт.
//Т.е. при записването да си цъквам интервал, текст и фонт. Като това ще определя дълбочината на записката
//Трябва да измисля какъв ще е принципа на работа с архивните записки, защото при всяка негова промяна ще ми се преебава
//подредбата в бъдеще, та трябва да е относително стабилен.

//Рисуване: най-вероятно в пейнтЕвент-а ще се прави първо списък със записки който се виждат
//(като се мине през списъка от филтрирани записки (дето още го няма)) после ще се определят позиции и ще се рисува

//Да оправя другите модули
//Да махна рециклирането на ID-та
//Да може да се линква към записки
//при смяна на езика докато съм в help-a текущият файл със записки става NULL
//paste-a да го има в менюто за десен бутон
//paste-ването да генерира само няколко записки ако са разделени от 2 нови реда
//При зареждането на записките да се прави проверка на вс note::id за дупликати и <=0
//Back button&shortcut
//При правене на линк като се цъкне на бялото поле и линкът понякога се закача за произволна записка
//arch package
//да преместя canvas в misli_desktop
//При натискане на ctrl да се появяват outline-и на това в clipboard-a
//Loading cursor и loading bar при смяна на NF
//Да напиша ясно, че не държи отделни прозорци
//Меrge with> меню за сливане на файлове със записки
//Моuse note-a го прави с някакво скапано id
//Relative paths за включените файлове
//Връщане на предишния файл със записки с backspace
//скоростта на приближаване и отдалечаване трябва да е квадратна функция
//да няма resize и double click , когато са натиснати ctrl или shift
//BUG:При преименуване на записка Title-a не се променя
//Да може да се линк-ва към папки
//Да има минимална височина на гледане
//Като се появи нов файл да го асоциира със сегашните липсващи
//Да търси само в текущата папка или да се избира къде да търси
//Линковете за директории да са с двойна граница
//Да има малко по-голяма стъпка за преместване на нещата, за да е лесно да се нареждат на една линия дори със скапана мишка
//При местене на записка не само да ресетва позицията на контролните точки на линковете, ами и да задава, че
//става дума за махане напрактика на контролните точки.
//крашва при добавяне на папка
//Като напиша програмата и въведа част от данните да се напуша и да си измисля добра структира/ментален образ
//за спомняне на това инфо

//Moдули за дневника:
//-Технически красоти (базова линия, watermark години и т.н.)
//-Обобщения (журнал)
//-Снимки
//-Записки
//-Тегло
//-Чатове - отделен widget
//-Geolocation - отделен widget
//-Имейли
//-ФБ събития

//Филтри за дневника:
//По стринг от URI-то (с възможност за конфигуриране на бутони, демек да мога да си запазвам филтри)
//По модул
//По важност

//====Future stuff====
//Мисли може да е уеб сървър доста лесно. Ще конвертира локално поисканата записка в
//уеб код и после само ще получава или праща дифове.
//Трололо мод при който записките бягат от мишката , който се активира автоматично на 1 април
//MIME type/file association
//http://doc.qt.io/qt-5/qmimedatabase.html = Get file type Qt
//when Chrome->Qt text/uri-list is fixed - accept multiple URIs

//====Release routine====
//update translations
//commit
//build on Windows
//build installer PS C:\C++\misli\misli\installer> C:\Qt\QtIFW2.0.0\bin\binarycreator.exe --offline-only -c config\config.xml -p packages MisliInstaller.exe

//=========Test cases===========
//Input inaccessible/non-existent dir when adding a dir

#include "mislidesktopgui.h"
#include "timelinemodule.h"

int main(int argc, char *argv[])
{
    MisliDesktopGui misli(argc, argv);

    //Timeline modules
    NotesModule notesModule;
    //misli.misliWindow->timelineWidget.timeline->addModule(&notesModule);

    return misli.exec();
}

